reference/openfoam/incompressible_backwards_step/system/probes_all.cfg
type            probes;
libs            ("libsampling.so");

writeControl    timeStep;
writeInterval   1;

fields (U p);

probeLocations
(
    (1.05 0.05 0)
    (1.15 0.05 0)
    (1.25 0.05 0)
    (1.35 0.05 0)
    (1.45 0.05 0)
    (1.55 0.05 0)
    (1.65 0.05 0)
    (1.75 0.05 0)
    (1.85 0.05 0)
    (1.95 0.05 0)
    (2.05 0.05 0)
    (2.15 0.05 0)
    (2.25 0.05 0)
    (2.35 0.05 0)
    (2.45 0.05 0)
    (2.55 0.05 0)
    (2.65 0.05 0)
    (2.75 0.05 0)
    (2.85 0.05 0)
    (2.95 0.05 0)
    (1.05 0.15 0)
    (1.15 0.15 0)
    (1.25 0.15 0)
    (1.35 0.15 0)
    (1.45 0.15 0)
    (1.55 0.15 0)
    (1.65 0.15 0)
    (1.75 0.15 0)
    (1.85 0.15 0)
    (1.95 0.15 0)
    (2.05 0.15 0)
    (2.15 0.15 0)
    (2.25 0.15 0)
    (2.35 0.15 0)
    (2.45 0.15 0)
    (2.55 0.15 0)
    (2.65 0.15 0)
    (2.75 0.15 0)
    (2.85 0.15 0)
    (2.95 0.15 0)
    (1.05 0.25 0)
    (1.15 0.25 0)
    (1.25 0.25 0)
    (1.35 0.25 0)
    (1.45 0.25 0)
    (1.55 0.25 0)
    (1.65 0.25 0)
    (1.75 0.25 0)
    (1.85 0.25 0)
    (1.95 0.25 0)
    (2.05 0.25 0)
    (2.15 0.25 0)
    (2.25 0.25 0)
    (2.35 0.25 0)
    (2.45 0.25 0)
    (2.55 0.25 0)
    (2.65 0.25 0)
    (2.75 0.25 0)
    (2.85 0.25 0)
    (2.95 0.25 0)
    (1.05 0.35 0)
    (1.15 0.35 0)
    (1.25 0.35 0)
    (1.35 0.35 0)
    (1.45 0.35 0)
    (1.55 0.35 0)
    (1.65 0.35 0)
    (1.75 0.35 0)
    (1.85 0.35 0)
    (1.95 0.35 0)
    (2.05 0.35 0)
    (2.15 0.35 0)
    (2.25 0.35 0)
    (2.35 0.35 0)
    (2.45 0.35 0)
    (2.55 0.35 0)
    (2.65 0.35 0)
    (2.75 0.35 0)
    (2.85 0.35 0)
    (2.95 0.35 0)
    (1.05 0.45 0)
    (1.15 0.45 0)
    (1.25 0.45 0)
    (1.35 0.45 0)
    (1.45 0.45 0)
    (1.55 0.45 0)
    (1.65 0.45 0)
    (1.75 0.45 0)
    (1.85 0.45 0)
    (1.95 0.45 0)
    (2.05 0.45 0)
    (2.15 0.45 0)
    (2.25 0.45 0)
    (2.35 0.45 0)
    (2.45 0.45 0)
    (2.55 0.45 0)
    (2.65 0.45 0)
    (2.75 0.45 0)
    (2.85 0.45 0)
    (2.95 0.45 0)
    (0.05 0.55 0)
    (0.15 0.55 0)
    (0.25 0.55 0)
    (0.35 0.55 0)
    (0.45 0.55 0)
    (0.55 0.55 0)
    (0.65 0.55 0)
    (0.75 0.55 0)
    (0.8500000000000001 0.55 0)
    (0.9500000000000001 0.55 0)
    (1.05 0.55 0)
    (1.15 0.55 0)
    (1.25 0.55 0)
    (1.35 0.55 0)
    (1.45 0.55 0)
    (1.55 0.55 0)
    (1.65 0.55 0)
    (1.75 0.55 0)
    (1.85 0.55 0)
    (1.95 0.55 0)
    (2.05 0.55 0)
    (2.15 0.55 0)
    (2.25 0.55 0)
    (2.35 0.55 0)
    (2.45 0.55 0)
    (2.55 0.55 0)
    (2.65 0.55 0)
    (2.75 0.55 0)
    (2.85 0.55 0)
    (2.95 0.55 0)
    (0.05 0.65 0)
    (0.15 0.65 0)
    (0.25 0.65 0)
    (0.35 0.65 0)
    (0.45 0.65 0)
    (0.55 0.65 0)
    (0.65 0.65 0)
    (0.75 0.65 0)
    (0.8500000000000001 0.65 0)
    (0.9500000000000001 0.65 0)
    (1.05 0.65 0)
    (1.15 0.65 0)
    (1.25 0.65 0)
    (1.35 0.65 0)
    (1.45 0.65 0)
    (1.55 0.65 0)
    (1.65 0.65 0)
    (1.75 0.65 0)
    (1.85 0.65 0)
    (1.95 0.65 0)
    (2.05 0.65 0)
    (2.15 0.65 0)
    (2.25 0.65 0)
    (2.35 0.65 0)
    (2.45 0.65 0)
    (2.55 0.65 0)
    (2.65 0.65 0)
    (2.75 0.65 0)
    (2.85 0.65 0)
    (2.95 0.65 0)
    (0.05 0.75 0)
    (0.15 0.75 0)
    (0.25 0.75 0)
    (0.35 0.75 0)
    (0.45 0.75 0)
    (0.55 0.75 0)
    (0.65 0.75 0)
    (0.75 0.75 0)
    (0.8500000000000001 0.75 0)
    (0.9500000000000001 0.75 0)
    (1.05 0.75 0)
    (1.15 0.75 0)
    (1.25 0.75 0)
    (1.35 0.75 0)
    (1.45 0.75 0)
    (1.55 0.75 0)
    (1.65 0.75 0)
    (1.75 0.75 0)
    (1.85 0.75 0)
    (1.95 0.75 0)
    (2.05 0.75 0)
    (2.15 0.75 0)
    (2.25 0.75 0)
    (2.35 0.75 0)
    (2.45 0.75 0)
    (2.55 0.75 0)
    (2.65 0.75 0)
    (2.75 0.75 0)
    (2.85 0.75 0)
    (2.95 0.75 0)
    (0.05 0.8500000000000001 0)
    (0.15 0.8500000000000001 0)
    (0.25 0.8500000000000001 0)
    (0.35 0.8500000000000001 0)
    (0.45 0.8500000000000001 0)
    (0.55 0.8500000000000001 0)
    (0.65 0.8500000000000001 0)
    (0.75 0.8500000000000001 0)
    (0.8500000000000001 0.8500000000000001 0)
    (0.9500000000000001 0.8500000000000001 0)
    (1.05 0.8500000000000001 0)
    (1.15 0.8500000000000001 0)
    (1.25 0.8500000000000001 0)
    (1.35 0.8500000000000001 0)
    (1.45 0.8500000000000001 0)
    (1.55 0.8500000000000001 0)
    (1.65 0.8500000000000001 0)
    (1.75 0.8500000000000001 0)
    (1.85 0.8500000000000001 0)
    (1.95 0.8500000000000001 0)
    (2.05 0.8500000000000001 0)
    (2.15 0.8500000000000001 0)
    (2.25 0.8500000000000001 0)
    (2.35 0.8500000000000001 0)
    (2.45 0.8500000000000001 0)
    (2.55 0.8500000000000001 0)
    (2.65 0.8500000000000001 0)
    (2.75 0.8500000000000001 0)
    (2.85 0.8500000000000001 0)
    (2.95 0.8500000000000001 0)
    (0.05 0.9500000000000001 0)
    (0.15 0.9500000000000001 0)
    (0.25 0.9500000000000001 0)
    (0.35 0.9500000000000001 0)
    (0.45 0.9500000000000001 0)
    (0.55 0.9500000000000001 0)
    (0.65 0.9500000000000001 0)
    (0.75 0.9500000000000001 0)
    (0.8500000000000001 0.9500000000000001 0)
    (0.9500000000000001 0.9500000000000001 0)
    (1.05 0.9500000000000001 0)
    (1.15 0.9500000000000001 0)
    (1.25 0.9500000000000001 0)
    (1.35 0.9500000000000001 0)
    (1.45 0.9500000000000001 0)
    (1.55 0.9500000000000001 0)
    (1.65 0.9500000000000001 0)
    (1.75 0.9500000000000001 0)
    (1.85 0.9500000000000001 0)
    (1.95 0.9500000000000001 0)
    (2.05 0.9500000000000001 0)
    (2.15 0.9500000000000001 0)
    (2.25 0.9500000000000001 0)
    (2.35 0.9500000000000001 0)
    (2.45 0.9500000000000001 0)
    (2.55 0.9500000000000001 0)
    (2.65 0.9500000000000001 0)
    (2.75 0.9500000000000001 0)
    (2.85 0.9500000000000001 0)
    (2.95 0.9500000000000001 0)
);
